[
  {
    "instructors":[
      "Michael Shiloh",
      "Aaron Sherwood"
    ],
    "terms":[
      "FALL",
      "SPRING",
      "JUNE"
    ],
    "description":{
      "short":"intro to interactive media",
      "long":"With the advent of digital computation, humans have found a variety of new tools for self expression and communication. By approaching software and electronics as artists and designers, we can explore new paradigms of interaction with machines and each other. This introductory course will provide students hands-on experience with screen-based and physical interaction design through programming and electronics."
    },
    "crosslisted":[
      "Art and Art History",
      "Film and New Media",
      "Media, Culture and Communication"
    ],
    "tags":[
      "intro"
    ],
    "title":"Introduction to Interactive Media",
    "program":"Interactive Media",
    "number":"IM-UH 1010",
    "track":"Physical Computing",
    "current":"true",
    "year":"2017",
    "link":"http://intro18fall.nyuad.im"
  },
  {
    "instructors":[
      "Craig Protzel",
      "Sarah Fay Krom",
      "Pierre Depaz"
    ],
    "terms":[
      "FALL",
      "SPRING"
    ],
    "description":{
      "short":"intro to multimedia storytelling",
      "long":"A production based course that surveys various technologies including digital imaging, video, audio, animation, and basic web development. The forms and uses of new communications technologies are explored in a laboratory context of experimentation and discussion. Principles of interpersonal communications and media theory are considered in this new context."
    },
    "crosslisted":[
      "Music",
      "Design",
      "Media, Culture and Communication"
    ],
    "tags":[
      "commlab"
    ],
    "title":"Communications Lab",
    "program":"Interactive Media",
    "number":"IM-UH 1011",
    "track":"Computational Media",
    "current":"true",
    "year":"2017",
    "link":"http://commlab.nyuad.im"
  },
  {
    "instructors":[
      "Michael Shiloh"
    ],
    "terms":[
      "NCO"
    ],
    "description":{
      "short":"intro to robot building",
      "long":"Intelligent robots living amongst ordinary people used to be a storyline relegated to the world of science-fiction. However, the 21st century has witnessed a rapid adoption of automated machinery in many aspects of daily life. In this course, students will explore the significance of today's robots through the context of art by learning about and building experimental robots for theatrical performance. Robots will be defined broadly, incorporating a wide range of machines both autonomous and remote-controlled. Students will be exposed to critical analysis regarding the historical and contemporary use of machines in art and theatrical performance. In parallel, students will also learn about electronics, programming, robotics and mechanical construction techniques. Over the course of the semester, students will iterate through multiple projects exploring how robots can convey meaning and emotion. The course will culminate with a final public performance by the robots. Experience with physical computing through Introduction to Interactive Media or a course equivalent is highly encouraged."
    },
    "crosslisted":[
      "????"
    ],
    "tags":[
      "robots"
    ],
    "title":"Performing Robots",
    "program":"Interactive Media",
    "number":"IM-UH 2117",
    "track":"Physical Computing",
    "current":"false",
    "year":"2017",
    "link":"????"
  },
  {
    "instructors":[
      "Aaron Sherwood"
    ],
    "terms":[
      "FALL"
    ],
    "description":{
      "short":"intro to mathematical principles in nature",
      "long":"How can we capture the unpredictable evolutionary and emergent properties of nature in software? How can understanding the mathematical principles behind our physical world help us to create digital worlds? And how can implementing these code-based simulations offer insight and perspective on both environmental and human behaviors. This course attempts to address these questions by focusing on the programming strategies and techniques behind computer simulations of natural systems using p5.js (a JavaScript library in the spirit of Java’s Processing framework). We will explore a variety of forces and behaviors that occur naturally in our physical world. This includes properties of movement, physics, genetics, and neural networks. For each topic, we will write code to simulate those occurrences in a digital environment. The results will usually be visual in nature and manifested in the form of interactive animated coding sketches."
    },
    "crosslisted":[
      "????"
    ],
    "tags":[
      "nature",
      "software"
    ],
    "title":"Decoding Nature",
    "program":"Interactive Media",
    "number":"IM-UH 2118-001",
    "track":"Computational Media",
    "current":"true",
    "year":"2017",
    "link":"http://decodingnature.nyuad.im/syllabus/"
  },
  {
    "instructors":[
      "Marina Zurkow"
    ],
    "terms":[
      "SPRING"
    ],
    "description":{
      "short":"explore method, documentation and presentation of research, as well as the merits of both success and failure.",
      "long":"What does it mean to become a “temporary expert?” How does one develop one’s own creative research-based practice? This course will address these questions by engaging with Abu Dhabi's environmental and social dimensions as a subject for research, context and imaginative art and design opportunities. Students will adopt a wide variety of tools and strategies in order to lay the foundations for a research-based art practice that considers materials, media, context, and audience, as well as one’s personal strengths and desires. Over the course of the semester, students will develop art and design projects that interface with a multiplicity of other disciplines, and engage in idea exchange with experts in the field. Through hands-on practice, case studies, and readings on systems thinking, communication, and the idea of \"the public,\" we will explore method, documentation and presentation of research, as well as the merits of both success and failure. "
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "research"
    ],
    "title":"Temporary Expert",
    "program":"Interactive Media",
    "number":"IM-UH 1113",
    "track":"Media & Design Thinking",
    "current":"true",
    "year":"2017",
    "link":""
  },
  {
    "instructors":[
      "Michael Shiloh"
    ],
    "terms":[
      "SPRING"
    ],
    "description":{
      "short":"Designing connected products.",
      "long":"This course explores the possibilities and challenges of designing alternate physical network interfaces. Through weekly readings, class discussions, and a series of projects, students will create physical objects that talk to each other over distance. Various wireless communication mechanisms such as radio (Bluetooth, Zigbee, WiFi, and raw), infrared, and ultrasonic are used in the context of creating novel “smart” devices. Topics of discussion in this course include networking protocols and network topologies; network time versus physical time; mobile objects; and wireless networks. Opportunities to build collaborative and creative campus-wide networked projects and systems will also be explored."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "network",
      "code"
    ],
    "title":"Network Everything",
    "program":"Interactive Media",
    "number":"IM-UH 2112",
    "track":"Physical Computing",
    "current":"true",
    "year":"2017",
    "link":"https://github.com/michaelshiloh/NetworkEverything"
  },
  {
    "instructors":[
      "Michael Shiloh"
    ],
    "terms":[
      "SPRING"
    ],
    "description":{
      "short":"Learn about fabrication and microcontrollers.",
      "long":"The saying goes, 'If all you have is a hammer, then every problem looks like a nail.' What if all you have is a 3D Printer? In this course, students will be introduced to, and engage critically with, a range of contemporary machines inside and around the Interactive Media Lab. Leveraging historical perspectives, current use-cases, and hands-on making, the course will explore how machines enhance, or limit, our creative processes. Readings and discussion will be paired with practical designing, prototyping, and making of creative computer controlled devices, such as drawing machines, musical instruments, and a collaborative Rube Goldberg contraption. Over the course of the semester, students will be exposed to a variety of tools, materials, and fabrication techniques as well as learn how to use micro-controllers and software to give their machines unique behaviors and abilities. By thinking about machines, using machines, and making machines, the course will offer insight into our creative relationships with our tools."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "fabrication",
      "arduino",
      "code"
    ],
    "title":"Machine Lab",
    "program":"Interactive Media",
    "number":"IM-UH 1112",
    "track":"Physical Computing",
    "current":"true",
    "year":"2017",
    "link":"https://github.com/michaelshiloh/MachineLab/"
  },
  {
    "instructors":[
      "Craig Protzel"
    ],
    "terms":[
      "NCO"
    ],
    "description":{
      "short":"Learn education theory through project-based work.",
      "long":"Making Education is a regional seminar course that will focus on education theory, instructional design, creative collaboration, and production of site-specific “maker” learning materials. Rooted in the Interactive Media culture of openness, accessibility and making, students will be challenged to thoughtfully navigate the education system in Kathmandu, Nepal and meaningfully affect learning opportunities in collaboration with our local partner organization. Iterative design cycles and project-based work will be paired with semi- formal research, theoretical analysis, ethnographic interviews, reflective writing, and project documentation. By researching, investigating, and applying creative educational models, students will experience a unique opportunity to apply the processes and principles of the Interactive Media Program onto a real-world use case. Ideally, a combination of making, teaching, and learning will result in insights that are both personally significant, locally relevant, and globally transferable. This course does involve a week-long Spring Break trip to Kathmandu, Nepal and a formal commitment to engage with our local partners."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "education"
    ],
    "title":"Making Education (Regional Seminar)",
    "program":"Interactive Media",
    "number":"IM-UH 2120",
    "track":"Media & Design Thinking",
    "current":"false",
    "year":"2017",
    "link":"https://github.com/craigprotzel/making-education/"
  },
  {
    "instructors":[
      "Aaron Sherwood"
    ],
    "terms":[
      "NCO"
    ],
    "description":{
      "short":"Artificial Intelligence through the lens of art.",
      "long":"Artificial intelligence and machine learning algorithms affect many aspects of our lives whether we realize it or not: banking transactions, healthcare treatments and diagnoses, entertainment recommendations, smart car functionality, customer service agents, financial trading... the list goes on and on. The power of these algorithms lies in their ability to leverage computers to \"study\" and \"learn\". Instead of programming a computer to do a specific task, we program the computer to train and teach itself how to do any number of tasks. As artists, how can we harness the power of these algorithms and apply them towards creative endeavors? This class will explore that basic question. Through a combination of high level applied machine learning techniques, speculative design of artificial intelligence, and some basic understanding of how these algorithms work at a low level, students will explore this rich new field. With their machine counterparts, they will create images, sounds, text, intuitive interactions, chatbots, and more. "
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "code",
      "artificial intelligence",
      "machine learning"
    ],
    "title":"A.rt I.ntel",
    "program":"Interactive Media",
    "number":"IM-UH 2119",
    "track":"Computational Media",
    "current":"true",
    "year":"2017",
    "link":"https://github.com/artintelclass/"
  },
  {
    "instructors":[
      "Jonny Farrow"
    ],
    "terms":[
      "FALL"
    ],
    "description":{
      "short":"Learn circuits from an arts perspective",
      "long":"Circuit Breakers! is a course designed to introduce students to the world of hardware hacking and circuit bending for artistic and mainly sonic ends. By literally opening up common battery powered objects such as toys and finding their circuit boards, one can change the behavior of the object by interrupting the flow of electricity, creating novel, unexpected outcomes. This technique has both predictable and unpredictable outcomes, but it is almost always satisfying. In addition to hacking off-the-shelf toys, students will also build their own circuits with a minimum amount of components. Many of the projects in this course center on common integrated circuits, which we will cajole, trick, and abuse in order to create art."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "circuits",
      "tinkering"
    ],
    "title":"Circuit Breakers!",
    "program":"Interactive Media",
    "number":"IM-UH 1110",
    "track":"Physical Computing",
    "current":"true",
    "year":"2017",
    "link":"http://circuitbreakers.nyuad.im/"
  },
  {
    "instructors":[
      "Craig Protzel"
    ],
    "terms":[
      "FALL"
    ],
    "description":{
      "short":"Learn the use of APIs, from the client to the server and back!",
      "long":"As the World Wide Web continues to grow and pervade our everyday lives, an ever-increasing amount of data and digital services are becoming accessible to us through public web APIs (Application Programming Interfaces). Common to many web sites, including YouTube, Twitter, Google Maps, Wikipedia and more, these web APIs offer a way to programmatically request and re-purpose endless troves of information. How might we use these available resources to create unique, creative, and compelling web experiences of our own? Subscribing to a process-oriented approach, much of class time will be spent reviewing and writing code, primarily Javascript, for client-side (front-end) web development."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "web"
    ],
    "title":"Mashups: Creating with Web APIs",
    "program":"Interactive Media",
    "number":"IM-UH 2110",
    "track":"Computational Media",
    "current":"true",
    "year":"2017",
    "link":"https://github.com/craigprotzel/Mashups"
  },
  {
    "instructors":[
      "Pierre Depaz"
    ],
    "terms":[
      "NCO"
    ],
    "description":{
      "short":"the relationship between code and politics",
      "long":"While our relationships between ourselves, our environment, and other people are inherently political, computer technologies and technology companies consistently claim to remain “neutral”. This course will assume the opposite —software is political—, and focus on how software applications share commonalities with political systems, how they affect their users as political actors and how we can build alternatives to those systems. This course is aimed at deconstructing the design and implementation of software as a political medium, such as Facebook’s timeline algorithm, city officials’ use of computer simulations to orchestrate urban life, blockchain-backed proof of ownership and algorithmic criminal assessment. Along with an introduction to political theory and media studies, coupled with an exploration of the underlying political impacts of those systems, students will work on several hands-on projects to offer functioning alternatives to those systems. To that end, this course will include several workshops in JavaScript and Python."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "code",
      "computer science",
      "politics"
    ],
    "title":"Politics of Code",
    "program":"Interactive Media",
    "number":"IM-UH 3110",
    "track":"Computational Media",
    "current":"false",
    "year":"2017",
    "link":"http://poc.nyuad.im"
  },
  {
    "instructors":[
      "Pierre Depaz"
    ],
    "terms":[
      "SPRING"
    ],
    "description":{
      "short":"Intro to Virtual Reality",
      "long":"This course will introduce students to the design and development of Virtual Reality experiences. We will examine these increasingly popular means of delivering content and social interactions and identify their unique affordances over existing platforms. Students will be challenged to harness the specific advantages of VR from conception through functional prototype. The class will also cover case studies of effective use of VR in information delivery, as well as social and artistic experiences. "
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "Virtual Reality",
      "code"
    ],
    "title":"Alternate Realities",
    "program":"Interactive Media",
    "number":"IM-UH 3111",
    "track":"Computational Media",
    "current":"true",
    "year":"2017",
    "link":"http://alt-realities.nyuad.im/"
  },
  {
    "instructors":[
      "Pierre Depaz"
    ],
    "terms":[
      "NCO"
    ],
    "description":{
      "short":"Intro to computer-aided artistic endeavours in visual arts",
      "long":"An introduction to the history, theory and practice of computer-aided artistic endeavours in the field of visual arts. This class will focus on the appearance of computers as a new tool for artists to integrate in their artistic practice, and how it shaped a specific aesthetic language across traditional practitioners and newcomers alike. We will be elaborating and discussing concepts and paradigms specific to computing platforms, such as system art, generative art, image processing and motion art. Drawing on those areas, students will explore their own artistic practice through the exclusive use of their computers. The course will also serve as a technical introduction to the OpenFrameworks programming environment to create works of visual art. As such, Software Art: Image will be an art history and critical studies course with a studio component. Software Art: Image is a complement to Software Art: Text, a 7-week course approaching software and computation from the perspective of poetry and fiction. The two courses can be taken in series or independently."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "code",
      "art history",
      "art"
    ],
    "title":"Software Art: Image",
    "program":"Interactive Media",
    "number":"IM-UH 2115",
    "track":"Computational Media",
    "current":"false",
    "year":"2017",
    "link":""
  },
  {
    "instructors":[
      "Pierre Depaz"
    ],
    "terms":[
      "NCO"
    ],
    "description":{
      "short":"Intro to computer-aided artistic endeavours in poetry",
      "long":"An introduction to the history, theory and practice of computer-aided artistic endeavours in the field of prose and poetry. This class will focus on the appearance and role of computers as a new way for artists to write and read both programming and natural languages. While elaborating and discussing concepts and paradigms specific to computing platforms, such as recomposition, stochastic writing and ambiguity, students will be encouraged to explore their own artistic practice through the exclusive use of their computers, by writing their own programs. As such, Software Art: Text will be a literary history and critical studies course with an active writing component (in both Python and English). Students will be exposed to new creative perspectives on reading and writing in the digital age. Software Art: Text is a complement to Software Art: Image, a 7-week course approaching software and computation from the perspective of the visual arts. The two courses can be taken in series or independently."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "code",
      "art history",
      "art",
      "poetry",
      "literature"
    ],
    "title":"Software Art: Text",
    "program":"Interactive Media",
    "number":"IM-UH 2116",
    "track":"Computational Media",
    "current":"false",
    "year":"2017",
    "link":""
  },
  {
    "instructors":[
      "Craig Protzel"
    ],
    "terms":[
      "NCO"
    ],
    "description":{
      "short":"creative web development, design, storytelling, and interaction",
      "long":""
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      "code",
      "art history",
      "art",
      "poetry",
      "literature"
    ],
    "title":"Explorable Stories",
    "program":"Interactive Media",
    "number":"CADT-UH 1015J",
    "track":"Computational Media",
    "current":"false",
    "year":"2017",
    "link":""
  },
  {
    "instructors":[
      "Craig Protzel"
    ],
    "terms":[
      "FALL"
    ],
    "description":{
      "short":"Intro to communication",
      "long":"From cave paintings to live video streams on smartwatches, this course will explore the development, reaction, and impact of some of humankind's most transformative inventions - its forms of communication. How have these inventions, such as writing, printing, photography, the telegraph, television, radio, and the internet, influenced human behavior throughout the course of history? What role do they play in shaping our lives today? Toward the end of the course, students will speculate on the future of communication technologies in a connected world by prototyping their own inventions and experiences. Readings and discussion will cover communication theory, technical processes, and creative applications. Writing assignments will be paired with practical assignments where students will be challenged to bring their analysis and ideas to life. We will also utilize the world wide web as a test bed for experiencing and experimenting with various forms of communication both old and new, ranging anywhere from the printing press to the 3D printer and everything in between."
    },
    "crosslisted":[
      "Core"
    ],
    "tags":[
      "code",
      "web",
      "art history"
    ],
    "title":"Communication & Technology",
    "program":"Interactive Media",
    "number":"IM-UH 1012",
    "track":"Media & Design Thinking",
    "current":"true",
    "year":"2017",
    "link":"http://commtech.nyuad.im/"
  },
  {
    "instructors":[
      "Sarah Fay Krom"
    ],
    "terms":[
      "FALL"
    ],
    "description":{
      "short":"intro to game studies, design and development",
      "long":"Games and play are deeply embedded in human culture. Play suggests a range of human experiences not easily contained by a common form. Games use their playable form to speak to the cultural spaces in which they reside. There is freedom in play. There is structure in games. How do they work together? This course explores how games structure play to serve their purpose, and how play inspires games to push expectations of popular culture. Informed by game studies and theories of play, students will study analog and digital games to consider the technological, spatial, artistic and social structures that shape a play experience. Utilizing web-based technologies and the Unity game engine, students will assume the role of both game designer and developer, experimenting with building game experiences that convey meaning as well as express aspects of humanity beyond contest and conflict. Some programming experience is preferred but not required."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      ""
    ],
    "title":"Games & Play",
    "program":"Interactive Media",
    "number":"IM-UH 2320",
    "track":"Computational Media",
    "current":"true",
    "year":"2018",
    "link":""
  },
  {
    "instructors":[
      "Sarah Fay Krom"
    ],
    "terms":[
      "SPRING"
    ],
    "description":{
      "short":"An introduction to the history, theory and practice of computer-based artistic endeavors in the field of visual arts.",
      "long":"To be updated."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      ""
    ],
    "title":"Software Art: ASCII to Algorithm",
    "program":"Interactive Media",
    "number":"IM-UH 2321",
    "track":"Computational Media",
    "current":"true",
    "year":"2019",
    "link":""
  },
  {
    "instructors":[
      "Marina Zurkow"
    ],
    "terms":[
      "SPRING"
    ],
    "description":{
      "short":"This seminar course is an introduction to the theories, questions and conditions that encompass interactive media, and cultivates a capacity for critical awareness to help inform and direct students’ creative practice.",
      "long":"To be updated."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      ""
    ],
    "title":"Understanding Interactive Media: Critical Questions & Theory",
    "program":"Interactive Media",
    "number":"IM-UH 1013",
    "track":"Media & Design Thinking",
    "current":"true",
    "year":"2019",
    "link":""
  },
  {
    "instructors":[
      "David Wrisley"
    ],
    "terms":[
      "SPRING"
    ],
    "description":{
      "short":"An introduction to the benefits and limitations of digital methods of both the benefits and limitations of digital methods in the context of humanities research and analysis.",
      "long":"To be updated."
    },
    "crosslisted":[
      ""
    ],
    "tags":[
      ""
    ],
    "title":"Introduction to Digital Humanities",
    "program":"Interactive Media",
    "number":"IM-UH 1511",
    "track":"Media & Design Thinking",
    "current":"true",
    "year":"2019",
    "link":""
  }
]
