[ {
    "name":"Aaron Sherwood",
    "roles":[
      "Program Head",
      "Assistant Arts Professor of Interactive Media",
      "Co-founder of Purring Tiger"
    ],
    "description":{
      "short":"multimedia performance",
      "long":"Aaron Sherwood is a new media artist exploring cause and effect through the mediums of sound and light. This takes the form of large scale audio/visual installations, sound sculptures, guerilla art interventions, and performance. In 2011, along with Kiori Kawai, he founded Purring Tiger, a multi-cultural, multimedia, experimental performance group dedicated to bringing people together in the context of art, in a subtext of wonder."
    },
    "courses":[
      "A.rt I.ntel",
      "Decoding Nature",
      "Sensors, body and motion",
      "Intro to Interactive Media"
    ],
    "current":"true",
    "website":"https://aaron-sherwood.com/",
    "email":"sherwood@nyu.edu",
    "image":"aaronsherwood.png"
  },
  {
    "name":"Joerg Blumtritt",
    "roles":[
      "Visiting Assistant Professor of Practice of Interactive Media"
    ],
    "description":{
      "short":"Die Wunde schließt der Speer nur, der sie schlug.",
      "long":"Joerg Blumtritt (*1970) is a creative technologist, researcher and professor for interactive media teaching at NYU Abu Dhabi. He founded startups in big data, mobile apps, and open source hardware. He consults businesses and public institutions in technology driven transformation. As political activist and researcher, Joerg works on projects regarding future of democratic participation and media."
    },
    "courses":[
      "Decoding Nature",
      "Politics of Code",
      "Communication and Technology",
      "Future Punk",
      "Mashups"
    ],
    "current":"true",
    "website":"",
    "email":"joerg.blumtritt@nyu.edu",
    "image":"joergblumtritt.jpg"
  },
  {
    "name":"Heather Dewey-Hagborg",
    "roles":[
      "Visiting Assistant Professor"
    ],
    "description":{
      "short":"Dr. Heather Dewey-Hagborg is a transdisciplinary artist and educator who is interested in art as research and critical practice.",
      "long":"Dr. Heather Dewey-Hagborg is a transdisciplinary artist and educator who is interested in art as research and critical practice. Her controversial biopolitical art practice includes the project Stranger Visions in which she created portrait sculptures from analyses of genetic material (hair, cigarette butts, chewed up gum) collected in public places.\n Heather has shown work internationally at events and venues including the World Economic Forum, the Daejeon Biennale, the Guangzhou Triennial, and the Shenzhen Urbanism and Architecture Biennale, the Van Abbemuseum, Transmediale and PS1 MOMA. Her work is held in public collections of the Centre Pompidou, the Victoria and Albert Museum, the Wellcome Collection, the Exploratorium, and the New York Historical Society, among others, and has been widely discussed in the media, from the New York Times and the BBC to Art Forum and Wired.\n Heather has a PhD in Electronic Arts from Rensselaer Polytechnic Institute. She is an artist fellow at AI Now, an Artist-in-Residence at the Exploratorium, as well as Science Center, and is an affiliate of Data & Society.\n She is also a co-founder and co-curator of REFRESH, an inclusive and politically engaged collaborative platform at the intersection of Art, Science, and Technology."
    },
    "courses":[
      "Bioart Practices",
      "Understanding IM",
      "Communication and Technology",
      "Capstone"
    ],
    "current":"true",
    "website":"http://deweyhagborg.com/",
    "email":"hdh216@nyu.edu",
    "image":"heatherdeweyhagborg.jpg"
  },
  {
    "name":"Jonny Farrow",
    "roles":[
      "Assistant Arts Professor Visual Arts and Interactive Media"
    ],
    "description":{
      "short":"Multi-disciplinary artist primarily working in sculpture, printmaking, sound, and transmission art.",
      "long":"Jonny Farrow is a multi-disciplinary artist primarily working in cast sculpture, printmaking, sound, and transmission art. His work stems from research into the liminal: from suppressed historical narratives, to popular mythologies, and to the far-reaching registers on the electro-magnetic spectrum. Coming out of New York’s Lower East Side music scene of the 90s, Farrow’s work also questions the narrative of expertise; with nearly every project, he embarks on learning a new skill set in order to disrupt viewer expectations as well as his own. For Farrow, this practice is both political and metaphysical. He has shown and presented work in New York, Chicago, San Francisco, Sweden, United Kingdom, Kuwait, and has had two solo exhibits in the United Arab Emirates. From 2011-2016 he produced The Distract and Disable Program broadcast on WGXC 90.7 FM in Hudson, NY, and his music and sound works have been released by Hello CD, free103point9, and Must Die Records. Along with an MA in music, he holds an MFA in Studio Art from the School of the Art Institute of Chicago, and currently teaches Visual Arts and Interactive Media courses at New York University Abu Dhabi."
    },
    "courses":[
      "Circuit Breakers!",
      "Foundations of 3D",
      "Print Studio 1",
      "Sound Art",
      "Grad Seminar"
    ],
    "current":"true",
    "website":"https://www.jonnyfarrow.net",
    "email":"jf613@nyu.edu",
    "image":"jonnyfarrow.jpg"
  },
  {
    "name":"Sarah Fay Krom",
    "roles":[
      "Assistant Professor of Practice of Interactive Media"
    ],
    "description":{
      "short":"visual language for interactive media",
      "long":"Sarah Fay Krom is an Assistant Professor of Practice of Interactive Media in the Division of Arts & Humanities at New York University Abu Dhabi. She holds a BFA from Carnegie Mellon University and an MFA from the Digital Arts and New Media program at the University of California, Santa Cruz. Sarah Fay’s work explores visually expressive interactive storyworlds and the underlying computational processes that expand and enrich their artistic palette. Her research interests are interactive storytelling, computational cinema and character performance, procedural animation, and visual media in digital games. Her professional work includes games, children’s media, and interactive installations. She is currently working on a game about “seeing as knowing” and the mediated visual message."
    },
    "courses":[
      "Communications Lab",
      "Games and Play",
      "Alternate Realities",
      "Games as Art",
      "Interactive Storytelling"
    ],
    "current":"true",
    "website":"https://sarahfaykrom.com",
    "email":"sfk3@nyu.edu",
    "image":"sarahfaykrom.jpg"
  },
  {
    "roles":[
      "Instructor of the Arts",
      "Lab Manager"
    ],
    "description":{
      "short":"new stillness",
      "long":"Ume Hussain is an interdisciplinary artist based in Washington, D.C. She received her MFA from at Maryland Institute College of Art. Through her interest in subtlety and quietness, she explores themes of stillness, security, contingency and the illusion of control. Her work incorporates video, sound, light and interactive media to engage and at times implicate her audience."
    },
    "courses":[
      ""
    ],
    "name":"Ume Hussain",
    "current":"true",
    "website":"https://umehussain.net/",
    "email":"uh242@nyu.edu",
    "image":"umehussain.jpg"
  },
  {
    "name":"Jack B. Du",
    "roles":[
      "Assistant Instructor of the Arts"
    ],
    "description":{
      "short":"making art with robots",
      "long":"Jack gratudated from NYU Shanghai with a degree in Computer Science, but when he studied away at NYU Abu Dhabi in his senior year, he took four Visual Art classes and he loved them. He built Minus E, a robot that creates large scale drawings."
    },
    "courses":[
      ""
    ],
    "current":"true",
    "website":"https://jackbdu.com/",
    "email":"jackbdu@nyu.edu",
    "image":"jackbdu.jpg"
  },
  {
    "name":"Rashid Al Qubaisi",
    "roles":["Lab Assistant"],
    "description":
    {
      "short":"I don't play basketball",
      "long":"My name is Rashid. I currently am majoring in Interactive Media and Economics. Most of my free time is spent on the golf course. In my opinion, the IM lab is one of the coolest places on campus as you can get almost anything done there."
    },
    "courses":[""],
    "current":"true",
    "website":"",
    "email":"raq217@nyu.edu",
    "image":"rashidalqubaisi.jpg"
  },
  {
    "name":"Li Cheng",
    "roles":["Lab Assistant"],
    "description":
    {
      "short":"I don't byte",
      "long":"I am a sophomore IM major and currently super interested in everything design and tech related. In my free time you can find me drinking matcha latte somewhere in the city."
    },
    "courses":[""],
    "current":"true",
    "website":"",
    "email":"li.cheng@nyu.edu",
    "image":"licheng.jpg"
  },
  {
    "name":"Maxim Blinov",
    "roles":["Lab Assistant"],
    "description":
    {
      "short":"“His card tricks are insane” -David Blaine",
      "long":"A junior majoring in Computer science and Interactive media. I like physical computation, so that’s why I started doing IM and had lots of fun with it. I do photography as my hobby and I can show some pretty cool card tricks."
    },
    "courses":[""],
    "current":"true",
    "website":"https://www.instagram.com/max_blin0v",
    "email":"Mab1312@nyu.edu",
    "image":"maximblinov.jpg"
  },
  {
    "name":"Junior Garcia",
    "roles":["Lab Assistant"],
    "description":
    {
      "short":"I prefer lemon pie over water.",
      "long":"Junior is a Computer Science and Interactive Media major who enjoys engaging with and attempting to make creative technology projects. You can recognize him through his incessant need to smile at any situation, be it appropriate or not. He likes to listen to jokes and funny stories, so please feel free to enlighten his day with such."
    },
    "courses":[""],
    "current":"true",
    "website":"http://juniorfranciscogarcia.com",
    "email":"jfg388@nyu.edu",
    "image":"juniorgarcia.jpg"
  },
  {
    "name":"Zheljko Nenadikj",
    "roles":["Lab Assistant"],
    "description":
    {
      "short":"Slavic engineer - nothing could go wrong.",
      "long":"Hi, my name is Zheljko, but you can call me Zheki. I am a Serbian guy interested and very passionate about biology, robotics, astronomy, and gaming. If you would like to chat about these topics or anything else honestly, I would love to too!"
    },
    "courses":[""],
    "current":"true",
    "website":"",
    "email":"zn382@nyu.edu",
    "image":"zheljkonenadikj.jpg"
  },
  {
    "name":"Ganjina Oripova ",
    "roles":["Lab Assistant"],
    "description":
    {
      "short":"Dont' be upsetti, eat your spaghetti ",
      "long":"I am a third-year student at NYUAD majoring in Interactive Media and minoring in Psychology, Music and Arabic. Since my childhood, I have had a keen interest in art and the way it can shape our lives. For me, design and art are inherently intertwined in a common desire to help us better capture reality and improve our vision. That is why for me, Interactive Media is about taking progressive steps in every aspect of design, small or large, in our everyday lives."
    },
    "courses":[""],
    "current":"true",
    "website":"http://www.go543.nyuadim.com",
    "email":"go543@nyu.edu",
    "image":"ganjinaoripova.jpg"
  }
]
