[
  {
    "name":"Craig Protzel",
    "roles":[
      "Program Head",
      "Asst. Prof. of Interactive Media"
    ],
    "description":{
      "short":"web, data, stories",
      "long":"Craig Protzel is a creative technologist from Los Angeles, California whose practice focuses on designing interactive computational spaces for education, exploration, and entertainment. His work often resides at the intersection of web development, computer science, multi-media production, and storytelling. Before joining NYU Abu Dhabi in 2014, Craig’s professional experience included working as a producer-editor in LA, a creative software developer in NYC, and an adjunct professor at NYU Tisch’s ITP."
    },
    "courses":[
      "Communication and Technology",
      "Communication Lab",
      "Mashups: Creating with Web API",
      "Making Education",
      "Explorable Stories"
    ],
    "current":"true",
    "website":"http://craigprotzel.com/",
    "email":"craig.protzel@nyu.edu",
    "image":"craigprotzel.jpg"
  },
  {
    "name":"Jonny Farrow",
    "roles":[
      "Lecturer of Visual Arts",
      "Lecturer of Interactive Media"
    ],
    "description":{
      "short":"sculpture, circuits, prints, sound",
      "long":"Jonny Farrow is a multi-disciplinary artist working in sculpture, printmaking, and sound. His work stems from research into the liminal: from suppressed historical narratives, to popular mythologies, to the far-reaching registers of the electro-magnetic spectrum. Farrow’s work also questions the narrative of expertise; with nearly every project, he embarks on learning a new skill set in order to disrupt viewer expectations as well as his own. He holds an MA in music and an MFA in Studio Art from the School of the Art Institute of Chicago, and is currently a lecturer in Visual Arts and Interactive Media at NYUAD."
    },
    "courses":[
      "Circuit Breakers!",
      "Foundations of 3D",
      "Sound Art",
      "Print Making"
    ],
    "current":"true",
    "website":"http://www.jonnyfarrow.net",
    "email":"jf613@nyu.edu",
    "image":"jonnyfarrow.jpg"
  },
  {
    "name":"Sarah Fay Krom",
    "roles":[
      "Assistant Professor of Practice of Interactive Media"
    ],
    "description":{
      "short":"visual language for interactive media",
      "long":"Sarah Fay Krom is an Assistant Professor of Practice of Interactive Media in the Division of Arts & Humanities at New York University Abu Dhabi. She holds a BFA from Carnegie Mellon University and an MFA from the Digital Arts and New Media program at the University of California, Santa Cruz. Sarah Fay’s work explores visually expressive interactive storyworlds and the underlying computational processes that expand and enrich their artistic palette. Her research interests are interactive storytelling, computational cinema and character performance, procedural animation, and visual media in digital games. Her professional work includes games, children’s media, and interactive installations. She is currently working on a game about “seeing as knowing” and the mediated visual message."
    },
    "courses":[
      "Communications Lab",
      "Games and Play",
      "Alternate Realities",
      "Games as Art",
      "Interactive Storytelling"
    ],
    "current":"true",
    "website":"https://sarahfaykrom.com",
    "email":"sfk3@nyu.edu",
    "image":"sarahfaykrom.jpg"
  },
  {
    "name":"Aaron Sherwood",
    "roles":[
      "Visiting Lecturer of Interactive Media",
      "Co-founder of Purring Tiger"
    ],
    "description":{
      "short":"multimedia performance",
      "long":"Aaron Sherwood is a new media artist exploring cause and effect through the mediums of sound and light. This takes the form of large scale audio/visual installations, sound sculptures, guerilla art interventions, and performance. In 2011, along with Kiori Kawai, he founded Purring Tiger, a multi-cultural, multimedia, experimental performance group dedicated to bringing people together in the context of art, in a subtext of wonder."
    },
    "courses":[
      "A.rt I.ntel",
      "Decoding Nature",
      "Sensors, body and motion",
      "Intro to Interactive Media"
    ],
    "current":"true",
    "website":"https://aaron-sherwood.com/",
    "email":"sherwood@nyu.edu",
    "image":"aaronsherwood.png"
  },
  {
    "name":"Marina Zurkow",
    "roles":[
      "Teacher"
    ],
    "description":{
      "short":"the way forward is developing an ecospheric mentality.",
      "long":"Marina Zurkow is a media artist focused on near-impossible nature and culture intersections. She uses life science, materials, and technologies – including food, software, clay, animation, mycelium, and petrochemicals (when necessary) – to foster intimate connections between people and non-human agents.\nZurkow is a John Simon Guggenheim Memorial Fellow. She has also been granted awards from the New York Foundation for the Arts, New York State Council for the Arts, the Rockefeller Foundation, and Creative Capital. She is on full time faculty at NYU’s Interactive Telecommunications Program (ITP) in Tisch School of the Arts, and lives in Brooklyn, NY. She is represented by bitforms gallery."
    },
    "courses":[
      "Temporary Expert",
      "Making the Anthropo(s)cene"
    ],
    "current":"true",
    "website":"http:/o-matic.com/",
    "email":"marinazurkow@me.com",
    "image":"marinazurkow.jpg"
  },
  {
    "roles":[
      "Instructor of the Arts",
      "Lab Manager"
    ],
    "description":{
      "short":"new stillness",
      "long":"Ume Hussain is an interdisciplinary artist based in Washington, D.C. She received her MFA from at Maryland Institute College of Art. Through her interest in subtlety and quietness, she explores themes of stillness, security, contingency and the illusion of control. Her work incorporates video, sound, light and interactive media to engage and at times implicate her audience."
    },
    "courses":[
      ""
    ],
    "name":"Ume Hussain",
    "current":"true",
    "website":"https://umehussain.net/",
    "email":"uh242@nyu.edu",
    "image":"umehussain.jpg"
  },
  {
    "name":"Jack B. Du",
    "roles":[
      "Assistant Instructor of the Arts"
    ],
    "description":{
      "short":"making art with robots",
      "long":"Jack gratudated from NYU Shanghai with a degree in Computer Science, but when he studied away at NYU Abu Dhabi in his senior year, he took four Visual Art classes and he loved them. He built Minus E, a robot that creates large scale drawings."
    },
    "courses":[
      ""
    ],
    "current":"true",
    "website":"https://jackbdu.com/",
    "email":"jackbdu@nyu.edu",
    "image":"jackbdu.jpg"
  },
  {
    "name":"Scott Fitzgerald",
    "roles":[
      "Former Program Head of Interactive Media",
      "Former Assistant Professor of Interactive Media"
    ],
    "description":{
      "short":"came up with the idea",
      "long":"Scott Fitzgerald is an artist and educator working with software and physical systems. He is currently an Assistant Arts Professor at NYU IDM and former head of the Interactive Media program at New York University Abu Dhabi. Scott regularly runs workshops on using technology in the arts and was previously the head of documentation for Arduino. While he occasionally curates gallery shows, he still prefers making things with his hands."
    },
    "courses":[
      "Intro to Interactive Media",
      "Light",
      "Experiential Video Art"
    ],
    "current":"true",
    "website":"https://scottfitzgerald.net/",
    "email":"scott.fitzgerald@nyu.edu",
    "image":"scottfitzgerald.jpg"
  },
  {
    "name":"Pierre Depaz",
    "roles":[
      "Former Lecturer of Interactive Media",
      "Howler Radio DJ"
    ],
    "description":{
      "short":"even javascript is political",
      "long":"Pierre is a political scientist and sofware developer from France. After studying Media Studies and Game Design, he has worked at the crossroads of art, technology and society. His projects ranged from theatrical performances to augmented reality for investigative journalism, at places like MoMA PS1, the Whitney Museum, the Washington Post and Stony Brook University. He is fascinated with languages, both for humans and machines."
    },
    "courses":[
      "Communication Lab",
      "Politics of Code",
      "Alternate Realities",
      "Software Art: Image",
      "Software Art: Text"
    ],
    "current":"false",
    "website":"https://pierredepaz.net/",
    "email":"pierre.depaz@nyu.edu",
    "image":"pierredepaz.jpg"
  },
  {
    "name":"James Hosken",
    "roles":[
      "Former Instructor of the Arts"
    ],
    "description":{
      "short":"abandoned ship",
      "long":"James was the first IM Instructor and Lab Manager. A Film Major, James is particularly interested in special effects, lights and physical computing. He is pursuing all of these endeavours at ITP."
    },
    "courses":[
      ""
    ],
    "current":"false",
    "website":"http://jameshosken.com/",
    "email":"james.hosken@nyu.edu",
    "image":"jameshosken.jpg"
  },
  {
    "name":"Russell Coke",
    "roles":["Lab Monitor"],
    "description":
    {
      "short":"Best thing since solderless breadboards",
      "long":"Russell is a self-professed nerd and lover of all things tech. He is CS major who loves creative coding and helping anyone who needs it... yes"
    },
    "courses":[""],
    "current":"true",
    "website":"",
    "email":"rc3469@nyu.edu",
    "image":"russellcoke.jpg"
  },
  {
    "name":"Steven Wyks",
    "roles":["Lab Monitor"],
    "description":
    {
      "short":"I leave my car on while pumping gas",
      "long":"Steven is a junior majoring in Interactive Media interested in the use of technology to create engaging experiences. Steven enjoys playing video games"
    },
    "courses":[""],
    "current":"true",
    "website":"https://stevenwyks.com",
    "email":"slw515@nyu.edu",
    "image":"stevenwyks.jpg"
  },
  {
    "name":"Paulin Alcoser",
    "roles":["Lab Monitor"],
    "description":
    {
      "short":"I just want to build my own R2-D2!",
      "long":"Hello"
    },
    "courses":[""],
    "current":"true",
    "website":"",
    "email":"pac469@nyu.edu",
    "image":"paulinalcoser.jpg"
  },
  {
    "name":"Jahnae Miller",
    "roles":["Lab Monitor"],
    "description":
    {
      "short":"riding 'til the final destination",
      "long":"Jahnae is a senior majoring in Computer Science with minors in Interactive Media and Mathematics. Her hobbies include playing video games"
    },
    "courses":[""],
    "current":"true",
    "website":"https://jahnaemiller.github.io",
    "email":"jahnae@nyu.edu",
    "image":"jahnaemiller.jpg"
  },
  {
    "name":"Mai Lootah",
    "roles":["Lab Monitor"],
    "description":
    {
      "short":"Hello World!",
      "long":"I'm currently a senior majoring in Interactive Media"
    },
    "courses":[""],
    "current":"true",
    "website":"",
    "email":"mkl406@nyu.edu",
    "image":"mailootah.jpg"
  },
  {
    "name":"Praggya Ayshwarya J.",
    "roles":["Lab Monitor"],
    "description":
    {
      "short":"An engineer in the right lab",
      "long":"Praggya is a third year computer engineer who is either a workaholic or a procrastinator - no in between. You will see her searching for WiFi or taking selfies the old school way on her new iPhone... as she dropped it and destroyed its WiFi antenna and front camera."
    },
    "courses":[""],
    "current":"true",
    "website":"",
    "email":"paj274@nyu.edu",
    "image":"praggyaayshwaryaj..jpg"
  }
]
